### Plan for production
🟢 Add aws_dynamodb_table.ab_test_participants
🟢 Add aws_dynamodb_table.ab_tests
🟢 Add aws_iam_policy.ab_testing_task_role_policy
🟢 Add aws_iam_role_policy_attachment.ab_testing_task_role_policy_attachment
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**4 to add, 0 to modify, 3 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # data.aws_iam_policy_document.ab_testing_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ab_testing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_test_participants",
              + "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_tests",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "vpc-08c2ab7b7b894be17",
                ]
              + variable = "aws:sourceVpc"
            }
        }
    }

  # aws_dynamodb_table.ab_test_participants will be created
  + resource "aws_dynamodb_table" "ab_test_participants" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "participantId"
      + id               = (known after apply)
      + name             = "ab_test_participants"
      + range_key        = "testName"
      + read_capacity    = 0
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Terraform"  = "true"
          + "table_name" = "ab_test_participants"
          + "team"       = "multi-product"
        }
      + tags_all         = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "table_name"     = "ab_test_participants"
          + "team"           = "multi-product"
        }
      + write_capacity   = 0

      + attribute {
          + name = "participantId"
          + type = "S"
        }
      + attribute {
          + name = "testName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.ab_tests will be created
  + resource "aws_dynamodb_table" "ab_tests" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "testName"
      + id               = (known after apply)
      + name             = "ab_tests"
      + read_capacity    = 0
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Terraform"  = "true"
          + "table_name" = "ab_tests"
          + "team"       = "multi-product"
        }
      + tags_all         = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "table_name"     = "ab_tests"
          + "team"           = "multi-product"
        }
      + write_capacity   = 0

      + attribute {
          + name = "testName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_policy.ab_testing_task_role_policy will be created
  + resource "aws_iam_policy" "ab_testing_task_role_policy" {
      + arn         = (known after apply)
      + description = "Allows the task access to specified AWS resources"
      + id          = (known after apply)
      + name        = "ab-testing-task-role-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # aws_iam_role_policy_attachment.ab_testing_task_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ab_testing_task_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ab-testing-task-role"
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "1621889730032612199" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T16:25:04Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "8769352595369005834" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T16:25:04Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.12-64" -> "0.0.13-69"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.12-64" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.13-69"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.12-64" -> "0.0.13-69"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.12-64" -> "0.0.13-69"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 0 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: production.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "production.plan"

```
</details>